Repository: Xcube-Studio/Natsurainko.FluentLauncher
Catalog: Natsurainko.FluentLauncher/Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru, zh_cn, zh_hans, zh_hant

# LSS_Info_Launch_ST
source: Go to Activities>Launch Tasks for details
zh_cn: 转到 活动>启动任务 中查看详细信息

# LSS_Info_Launch_T
source: Successfully added "Launch Game Core {Id}" to the quest
zh_cn: 成功将 "启动 游戏核心 {Id}" 添加到任务中

# LSS_InstallJavaDialog_InstallCancelled
source: Cancelled Install Java Runtime
zh_cn: 已取消安装 Java 运行时

# LSS_JavaInstaller_Title
source: Install new Java runtime: {title}
zh_cn: 安装新的 Java 运行时：{title}

# LSS_MinecraftProcessor_ExitedDescription
source: Exited Code: {code}
zh_cn: 退出码：{code}

# LSS_MinecraftProcessor_ExitedMessage_1
source: Game Crashed:
zh_cn: 游戏崩溃：

# LSS_MinecraftProcessor_ExitedMessage_2
source: Game Exited:
zh_cn: 游戏退出：

# LSS_MinecraftProcessor_State_1
source: Task not started
zh_cn: 任务未启动

# LSS_MinecraftProcessor_State_2
source: Checking game dependencies
zh_cn: 正在检查游戏依赖

# LSS_MinecraftProcessor_State_3
source: Game is launching
zh_cn: 游戏启动中

# LSS_MinecraftProcessor_State_4
source: Game is running
zh_cn: 游戏运行中

# LSS_MinecraftProcessor_State_5
source: Failed to launch
zh_cn: 启动失败

# LSS_MinecraftProcessor_State_6
source: Launch cancelled
zh_cn: 启动已取消

# LSS_MinecraftProcessor_State_7
source: Completing game dependencies: Completed: {message}
zh_cn: 正在补全游戏依赖：已完成：{message}

# LSS_MinecraftProcessor_State_8
source: Completed game dependencies
zh_cn: 补全游戏依赖完成

# LSS_MinecraftProcessor_State_9
source: Game is exited
zh_cn: 游戏已退出

# LSS_MinecraftProcessor_Title
source: Game Core: {Id}
zh_cn: 游戏核心：{Id}

# LSS_ModDownload_Failed_ST1
source: Mod file not selected!
zh_cn: 未选中模组文件！

# LSS_ModDownload_Failed_ST2
source: The game folder is not selected, or the current game folder does not exist!
zh_cn: 未选中游戏文件夹，或当前游戏文件夹不存在！

# LSS_ModDownload_Failed_T1
source: Unable to download the mod:
zh_cn: 无法下载模组：

# LSS_ModDownload_Failed_T2
source: Module resource download failed: {fileName}
zh_cn: 模组资源下载失败：{fileName}

# LSS_ModDownload_Title
source: Module resource download: {fileName}
zh_cn: 模组资源下载：{fileName}

# LSS_PDP_Converter_Count
source: {count} in total
zh_cn: 共计 {count} 个

# LSS_PMP_Converter_ModDescription
source: {name}; Version: {version}; Authors: {authors}|,
zh_cn: {name}；版本：{version}；作者：{authors}|，

# LSS_Release
source: Release Edition
zh_cn: 正式版

# LSS_RMP_Converter_Day
source: Days
zh_cn: 天

# LSS_RMP_Converter_DownloadCount
source: {downloadCount} Downloads
zh_cn: {downloadCount} 次下载

# LSS_RMP_Converter_Hour
source: Hours
zh_cn: 小时

# LSS_RMP_Converter_Update
source: Updated before {time},
zh_cn: {time} 前更新，

# LSS_SAP_Converter_Microsoft
source: Microsoft Account
zh_cn: 微软账户

# LSS_SAP_Converter_Offline
source: Offline Account
zh_cn: 离线账户

# LSS_SAP_Converter_Unknown
source: Unknown
zh_cn: 未知

# LSS_SAP_Converter_Yggdrasil
source: Yggdrasil Account
zh_cn: 外置账户

# LSS_SettingAccountPage_AddCancel
source: Cancelled Add Account
zh_cn: 已取消添加账户

# LSS_SettingAccountPage_AddFailed
source: Failed to verify account:
zh_cn: 验证账户失败：

# LSS_SettingAccountPage_AddSuccess
source: Account added successfully: {0} {1}
zh_cn: 添加账户成功：{0} {1}

# LSS_SettingAccountPage_AddWelcome
source: Welcome back, {0}
zh_cn: 欢迎回来, {0}

# LSS_SettingLaunchPage_SearchJava
source: Added the discovered Java runtime to the list of runtimes
zh_cn: 已将搜索到的 Java 运行时 添加至运行时列表

# LSS_SimpleDownloader_State_1
source: Ready to download
zh_cn: 准备开始下载

# LSS_SimpleDownloader_State_2
source: Downloading: {message}
zh_cn: 下载中：{message}

# LSS_SimpleDownloader_State_3
source: Download completed
zh_cn: 已完成下载

# LSS_SLP_Converter_MaxMemory
source: Maximum memory (MB)
zh_cn: 最大内存(MB)

# LSS_SLP_Converter_MinMemory
source: Minimum memory (MB):
zh_cn: 最小内存(MB)

# MainContainer_NVI_Activities.Content
source: Activities
zh_cn: 活动

# MainContainer_NVI_Cores.Content
source: Cores
zh_cn: 核心

# MainContainer_NVI_Home.Content
source: Home
zh_cn: 主页

# MainContainer_NVI_Resources.Content
source: Resources
zh_cn: 资源

# MainContainer_NVI_Settings.Content
source: Settings
zh_cn: 设置

# OutputDialog_T.Text
source: Game Running Logs
zh_cn: 游戏运行日志

# PropertyDetailsPage_B_1.Content
source: Open Folder
zh_cn: 打开文件夹

# PropertyDetailsPage_B_2.Text
source: Delete this core
zh_cn: 删除该核心

# PropertyDetailsPage_S_T_1.Text
source: Path:
zh_cn: 路径：

# PropertyDetailsPage_S_T_2.Text
source: Size:
zh_cn: 大小：

# PropertyDetailsPage_S_T_3_1.Text
source: Mod Loader:
zh_cn: Mod 加载器：

# PropertyDetailsPage_S_T_3_2.Text
source: Installed
zh_cn: 已安装

# PropertyDetailsPage_S_T_4.Text
source: Dependency Libraries:
zh_cn: 依赖库：

# PropertyDetailsPage_S_T_5.Text
source: Dependency Assets:
zh_cn: 依赖资源：

# PropertyDetailsPage_S_T_6.Text
source: Last Launch Time:
zh_cn: 上次启动时间：

# PropertyLaunchPage_Ex_H1.Text
source: Enable specific game settings
zh_cn: 启用特定游戏设置

# PropertyLaunchPage_Ex_W1.Text
source: Core independent:
zh_cn: 版本隔离：

# PropertyModPage_Ex_H.Title
source: Core independent is not enabled for this core, and all mods are automatically inherited from the currently selected game directory
zh_cn: 该游戏核心未开启版本隔离，所有模组自动继承自当前选中的游戏目录

# PropertyModPage_I_ST.Content
source: Go to Resources to install new mods
zh_cn: 转到 资源 以安装新的模组

# PropertyModPage_I_T.Text
source: There are no installed mods yet
zh_cn: 还没有任何已安装的模组

# ResourcesInstallPage_ComboBox.PlaceholderText
source: Select the core to install
zh_cn: 选择要安装的游戏核心

# ResourcesInstallPage_Confirm.Text
source: Confirm
zh_cn: 确认

# ResourcesInstallPage_EnableIndependently.Text
source: Enable core independence
zh_cn: 为该版本启用版本独立

# ResourcesInstallPage_EnableLoader.Text
source: Enable loader
zh_cn: 启用加载器

# ResourcesInstallPage_EnableLoader_Type.Text
source: The type of enabled loader
zh_cn: 启用的加载器类型

# ResourcesInstallPage_Install.Text
source: Install
zh_cn: 安装

# ResourcesInstallPage_SelectedLoader.Text
source: Currently selected loader:
zh_cn: 当前选中的加载器：

# ResourcesInstallPage_ShowOld.Content
source: Show old edition
zh_cn: 显示远古版

# ResourcesInstallPage_ShowSnapshot.Content
source: Show snapshot edition
zh_cn: 显示快照版

# ResourcesInstallPage_Title.Text
source: Install new game core
zh_cn: 安装新的游戏核心

# ResourcesInstallPage_UnsupportLoader.Text
source: This core does not support any type of loader
zh_cn: 该版本不支持任何类型的加载器

# ResourcesModPage_A.PlaceholderText
source: Search for mods on CurseForge
zh_cn: 在 CurseForge 上搜索模组

# ResourcesModPage_B1.Content
source: Clear all filter options
zh_cn: 清除所有过滤选项

# ResourcesModPage_B2.Content
source: Add to Download Tasks
zh_cn: 添加到下载任务

# ResourcesModPage_B_T.Text
source: Filter
zh_cn: 过滤器

# ResourcesModPage_C1.PlaceholderText
source: Loader Type
zh_cn: 加载器类型

# ResourcesModPage_C2.PlaceholderText
source: Game Version
zh_cn: 游戏版本

# ResourcesModPage_C3.PlaceholderText
source: Select Version
zh_cn: 选择版本

# ResourcesModPage_C4.PlaceholderText
source: Select Mod File
zh_cn: 选择模组文件

# ResourcesPage_ExD_1.Description
source: You can install new cores and loaders, the cores will be installed in the current folder
zh_cn: 你可以安装新的核心及加载器，核心将会被安装到当前文件夹内

# ResourcesPage_ExD_1.Title
source: Install New Game Core
zh_cn: 安装新的核心

# ResourcesPage_ExD_2.Description
source: You can install modules for the currently selected core by searching and downloading
zh_cn: 你可以通过搜索、下载为当前选中的核心安装模组

# ResourcesPage_ExD_2.Title
source: Search and Download Modules
zh_cn: 搜索、下载模组

# ResourcesPage_ExD_3.Description
source: Install the new Java runtime, it will be installed inside the application
zh_cn: 安装新的 Java 运行时，它将被安装在应用程序内

# ResourcesPage_ExD_3.Title
source: Install the New Java Runtime
zh_cn: 安装新的 Java 运行时

# ResourcesPage_ExD_4.Description
source: Import the integration package, the core it carries will be installed into the current folder
zh_cn: 导入整合包，其携带的核心将会被安装到当前文件夹内

# ResourcesPage_ExD_4.Title
source: Install the Mcbbs integration package
zh_cn: 安装 Mcbbs 整合包

# ResourcesPage_ExD_5.Description
source: As the name suggests, a simple downloader
zh_cn: 如名，一个简单的下载器

# ResourcesPage_ExD_5.Title
source: Multithreaded Shard Downloader
zh_cn: 多线程分片下载器

# SettingAboutPage_CheckUpdate.Content
source: Check Updates in Microsoft Store
zh_cn: 在商店中检查更新

# SettingAboutPage_DownloadSource.Text
source: Provide Download Source
zh_cn: 提供下载镜像源

# SettingAboutPage_Ex_Author.Description
source: the Developer of this Application
zh_cn: 本应用的开发者

# SettingAboutPage_Ex_Sources.Description
source: Navigate to the GitHub repository
zh_cn: 点击此项跳转 GitHub 仓库

# SettingAboutPage_Ex_Sources.Title
source: Sources
zh_cn: 开源

# SettingAboutPage_Ex_Statement.Description
source: Minecraft is copyrighted by Mojang Studios. We are not responsible for any copyright infringement arising from use of this software.
zh_cn: Minecraft 版权归 Mojang Studios 所有。 开发者对因使用本软件而引起的任何版权侵权不承担任何责任。

# SettingAboutPage_Ex_Statement.Title
source: Statements
zh_cn: 声明

# SettingAboutPage_Ex_Thanks.Description
source: Thanks for all the services provided to this app
zh_cn: 感谢所有为本应用提供的服务

# SettingAboutPage_Ex_Thanks.Title
source: Acknowledgments
zh_cn: 鸣谢

# SettingAboutPage_Ex_Usings.Description
source: Libraries used for this application development
zh_cn: 本应用开发使用的库

# SettingAboutPage_Ex_Usings.Title
source: References
zh_cn: 引用

# SettingAccountPage_Ex_H.Description
source: Account after entering the game
zh_cn: 游戏进入后的账户

# SettingAccountPage_Ex_H.Title
source: Accounts
zh_cn: 账户

# SettingAccountPage_Ex_W1.Text
source: Current account:
zh_cn: 当前的账户：

# SettingAccountPage_Ex_W2.Text
source: Details of the current account:
zh_cn: 当前账户的详细信息：

# SettingAccountPage_Ex_W2_T1.Text
source: Access Token:
zh_cn: 验证令牌：

# SettingAccountPage_Ex_W2_T2.Text
source: Authenticate Server:
zh_cn: 验证服务器：

# SettingAccountPage_Ex_W3.Text
source: Add new account:
zh_cn: 添加新的账户：

# SettingAccountPage_Ex_W3_B.Text
source: Sign in
zh_cn: 登录

# SettingAccountPage_Ex_W4.Text
source: Remove current account:
zh_cn: 移除当前账户：

# SettingAccountPage_Ex_W4_B.Text
source: Remove
zh_cn: 移除

# SettingAccountPage_Ex_W5.Text
source: Launch the game with a Demo account:
zh_cn: 以 Demo 账户启动游戏：

# SettingDownloadPage_Ex_H.Description
source: Configuration for downloading game assets when launching the game
zh_cn: 启动游戏时下载游戏资源的配置

# SettingDownloadPage_Ex_H.Title
source: Downloader
zh_cn: 下载器

# SettingDownloadPage_Ex_W1.Text
source: Current download sources:
zh_cn: 当前的下载源：

# SettingDownloadPage_Ex_W2.Text
source: Maximum number of download threads:
zh_cn: 最大下载线程数：

# SettingDownloadPage_Ex_W3.Text
source: Enable fragmented download of large files:
zh_cn: 启用大文件分片下载：

# SettingLaunchPage_Ex_H.Description
source: Where to store the core of your game
zh_cn: 存储你游戏核心的地方

# SettingLaunchPage_Ex_H.Title
source: .minecraft Folder
zh_cn: .minecraft 文件夹

# SettingLaunchPage_Ex_H1.Description
source: Executable to launch the game
zh_cn: 启动游戏的可执行文件

# SettingLaunchPage_Ex_H1.Title
source: Java Runtime
zh_cn: Java 运行时

# SettingLaunchPage_Ex_H2.Description
source: Game play settings
zh_cn: 游戏运行设置

# SettingLaunchPage_Ex_H2.Title
source: Game Settings
zh_cn: 游戏设置

# SettingLaunchPage_Ex_H3.Title
source: Language Settings
zh_cn: 语言设置

# SettingLaunchPage_Ex_W1.Text
source: Current .minecraft folder:
zh_cn: 当前的 .minecraft 目录：

# SettingLaunchPage_Ex_W10.Text
source: Global core independent:
zh_cn: 全局版本隔离：

# SettingLaunchPage_Ex_W11.Text
source: Full screen mode:
zh_cn: 全屏模式：

# SettingLaunchPage_Ex_W12.Text
source: Game window resolution:
zh_cn: 游戏窗口分辨率：

# SettingLaunchPage_Ex_W13.Text
source: Server address:
zh_cn: 服务器地址：

# SettingLaunchPage_Ex_W14.Text
source: Game window title:
zh_cn: 游戏窗口标题：

# SettingLaunchPage_Ex_W2.Text
source: Open the .minecraft folder:
zh_cn: 打开 .minecraft 目录：

# SettingLaunchPage_Ex_W2_B.Text
source: Browse
zh_cn: 浏览

# SettingLaunchPage_Ex_W3.Text
source: Remove the current .minecraft folder:
zh_cn: 移除当前 .minecraft 目录：

# SettingLaunchPage_Ex_W3_B.Text
source: Remove
zh_cn: 移除

# SettingLaunchPage_Ex_W4.Text
source: Current Java runtime:
zh_cn: 当前的 Java 运行时：

# SettingLaunchPage_Ex_W5.Text
source: Open the Java runtime:
zh_cn: 打开 Java 运行时：

# SettingLaunchPage_Ex_W5_B.Text
source: Browse
zh_cn: 浏览

# SettingLaunchPage_Ex_W5_B1.Text
source: Search
zh_cn: 搜索

# SettingLaunchPage_Ex_W6.Text
source: Remove the current Java runtime:
zh_cn: 移除当前 Java 运行时：

# SettingLaunchPage_Ex_W6_B.Text
source: Remove
zh_cn: 移除

# SettingLaunchPage_Ex_W7.Text
source: JVM memory:
zh_cn: JVM 运行内存：

# SettingLaunchPage_Ex_W8.Text
source: Automatically allocate JVM memory:
zh_cn: 自动分配 JVM 运行内存：

# SettingLaunchPage_Ex_W9.Text
source: Current Java runtime details:
zh_cn: 当前的 Java 运行时详细信息：

# SettingLaunchPage_Ex_W9_1.Text
source: Java virtual machine version:
zh_cn: Java 虚拟机版本：

# SettingLaunchPage_Ex_W9_2.Text
source: Java Virtual Machine Publisher:
zh_cn: Java 虚拟机发布者：

# SettingsPage_NVI_About.Content
source: About
zh_cn: 关于

# SettingsPage_NVI_Account.Content
source: Account Settings
zh_cn: 账户设置

# SettingsPage_NVI_Download.Content
source: Download Settings
zh_cn: 下载设置

# SettingsPage_NVI_Launch.Content
source: Global Launch Settings
zh_cn: 全局启动设置

# ToggleSwitch.OffContent
source: Off
zh_cn: 关

# ToggleSwitch.OnContent
source: On
zh_cn: 开
